fugreat/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/ble_app_template/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;       //设备名称全称              //STEP  1
    init.advdata.include_appearance      = true;                                        //包含外观特征              //STEP  2
    //设置蓝牙的可发现模式BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE一般可发现模式
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;     //STEP  4

    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);    //STEP  3       包含全部的UUID   //取消这两行为广播中包含部分的UUID
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;//

    init.config.ble_adv_fast_enabled  = true;                           //设置快速广播模式
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;   //广播间隔
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;   //广播持续时间  设置为0的时候表明不超时
    //广播时间回调函数
    init.evt_handler = on_adv_evt;
    //初始化广播
    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool *p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.


    /***********************************************************************************/
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    Board_LED0Init();
    SPI_Init();
    /***********************************************************************************/

    power_management_init();
    ble_stack_init();
    gap_params_init();      //GAP服务设置函数
    gatt_init();
    advertising_init();     //ADV设置函数
    services_init();            //设备信息服务初始化
    conn_params_init();
    peer_manager_init();    //首次连接参数协商与连接参数协商设置

    /**********************************************************************************/

    // Start execution.
    NRF_LOG_INFO("Template example started.");
    application_timers_start();

    advertising_start(erase_bonds);


    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
